#pragma once

// RogueCompany (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class KillstreakUINew.GuidedMenuCalloutData
// 0x0028 (0x0050 - 0x0028)
class UGuidedMenuCalloutData : public UObject
{
public:
	struct FText                                       HeaderText;                                               // 0x0028(0x0018) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FGuidedCalloutCardData>              CalloutCards;                                             // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.GuidedMenuCalloutData");
		return ptr;
	}

};


// Class KillstreakUINew.GuidedMenuCalloutsViewRedirector
// 0x0010 (0x0038 - 0x0028)
class UGuidedMenuCalloutsViewRedirector : public UPUMG_ViewRedirecter
{
public:
	class UDataTable*                                  GuidedCalloutsTable;                                      // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.GuidedMenuCalloutsViewRedirector");
		return ptr;
	}


	void SetNPEGuidedCalloutSeen(EConfigPropertyGuidedCalloutScenes* GuidedCalloutScene);
	bool HasSeenNPEGuidedCallout(EConfigPropertyGuidedCalloutScenes* GuidedCalloutScene);
};


// Class KillstreakUINew.KSWidget
// 0x0040 (0x04D8 - 0x0498)
class UKSWidget : public UPUMG_Widget
{
public:
	unsigned char                                      bIsUIOnlyWidget;                                          // 0x0498(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsExclusiveMenuWidget;                                   // 0x0499(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTickAnimationManager*                       TickAnimations;                                           // 0x04A0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ViewportEvent;                                            // 0x04A8(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      bSubstituteKillCamWorld;                                  // 0x04B8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bSubstituteKillCamOwningPlayer;                           // 0x04B9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bWantsKillCamCallbacks;                                   // 0x04BA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1D];                                      // 0x04BB(0x001D) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSWidget");
		return ptr;
	}


	void UnbindFromViewportSizeChange();
	void TriggerGlobalInvalidate();
	void StopTickAnimation(struct FName* AnimName);
	void SkipToEndTickAnimation(struct FName* AnimName);
	void SetAllAnimationsPlaybackSpeed(float* PlaybackSpeed);
	void ResumeTickAnimation(struct FName* AnimName);
	void RemoveTickAnimation(struct FName* AnimName);
	void PlayTickAnimation(struct FName* AnimName);
	void PauseTickAnimation(struct FName* AnimName);
	bool IsInKillCamPlayback();
	void InitializeTickAnimations();
	bool GetTickAnimationInfo(struct FName* AnimName, struct FTickAnimationParams* OutAnimParams);
	class APlayerController* GetNormalOwningPlayer();
	class APlayerController* GetKillCamSpectatorController();
	class APlayerController* GetActivePlayerController();
	void BlueprintPrepareKillCamPlayback();
	void BlueprintFinishKillCamPlayback();
	void BindToViewportSizeChange(struct FScriptDelegate* InViewportEvent);
	void AddTickAnimation(struct FName* AnimName, float* Duration, struct FScriptDelegate* UpdateEvent, struct FScriptDelegate* FinishedEvent);
};


// Class KillstreakUINew.KSAccoladeQueueWidget
// 0x0048 (0x0520 - 0x04D8)
class UKSAccoladeQueueWidget : public UKSWidget
{
public:
	unsigned char                                      IsBusy;                                                   // 0x04D8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumInQueue;                                               // 0x04DC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnAccoladeReceived;                                       // 0x04E0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x04E0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnAccoladeUpdateMultiplier;                               // 0x04F0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x04F0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned char                                      UnknownData02[0x20];                                      // 0x0500(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAccoladeQueueWidget");
		return ptr;
	}


	void Queue(TArray<struct FAccoladeEventEntry>* Accolades);
	void OnAccoladeRemovedFromScreen(struct FAccoladeDisplayInfo* AccoladeRemoved);
	bool GetNext(struct FAccoladeDisplayInfo* Accolade);
	void ClearAccoladeQueue();
};


// Class KillstreakUINew.KSAcquisitionModal
// 0x0000 (0x04D8 - 0x04D8)
class UKSAcquisitionModal : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAcquisitionModal");
		return ptr;
	}


	void SetupBindings();
	void HandleShowAcquisitionModal(class UPUMG_StoreItem** pItem);
	class UPUMG_AcquisitionManager* GetAcquisitionManager();
};


// Class KillstreakUINew.KSPawnWidget
// 0x0020 (0x04F8 - 0x04D8)
class UKSPawnWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x04D8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSPawnWidget");
		return ptr;
	}


	void SetPlayerStateUIRelevanceChanged();
	void SetPawn(class AKSCharacter** NewPawn);
	void PreClearPlayerState();
	void PreClearPawn();
	void PostSetPlayerState();
	void PostSetPawn();
	void OnBoundPlayerStateDestroyed(class AActor** DestroyedActor);
	void OnBoundPawnDestroyed(class AActor** DestroyedActor);
	class AKSPlayerState* GetPlayerState();
	class AKSCharacterBase* GetPawnBase();
	class AKSCharacter* GetPawn();
};


// Class KillstreakUINew.KSPawnInventoryWidget
// 0x0070 (0x0568 - 0x04F8)
class UKSPawnInventoryWidget : public UKSPawnWidget
{
public:
	TMap<uint16_t, class UKSWeaponComponentWidget*>    EquipmentWidgets;                                         // 0x04F8(0x0050) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0548(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSPawnInventoryWidget");
		return ptr;
	}


	bool RemoveWidgetFor(class UKSWeaponComponent** InWeaponComponent);
	class UKSWeaponComponentWidget* GetWidgetForWeaponComponent(class UKSWeaponComponent** InWeaponComponent);
	void EquipmentRemoved(class UKSWeaponComponent** RemovedEquipment);
	void EquipmentEndActive(class UKSWeaponComponent** InactiveEquipment);
	void EquipmentBecomeActive(class UKSWeaponComponent** ActiveEquipment);
	void EquipmentAdded(class UKSWeaponComponent** AddedEquipment);
	class UKSWeaponComponentWidget* CreateWeaponComponentWidgetFor(class UObject** WorldContextObject, class UKSWeaponComponent** InWeaponComponent, class UClass** WidgetClass, class APlayerController** OwningPlayer);
};


// Class KillstreakUINew.KSActiveWeaponComponentWidget
// 0x0038 (0x05A0 - 0x0568)
class UKSActiveWeaponComponentWidget : public UKSPawnInventoryWidget
{
public:
	int                                                ActiveWeaponSlot;                                         // 0x0568(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FGameplayTagContainer                       EquipPointsToIgnore;                                      // 0x0570(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bDelayClearUntilNextTick;                                 // 0x0590(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TWeakObjectPtr<class UKSWeaponComponent>           WeakActiveWeaponComponentPtr;                             // 0x0594(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSActiveWeaponComponentWidget");
		return ptr;
	}


	void PreClearActiveWeaponComponent();
	void PostSetActiveWeaponComponent();
	class UKSWeaponComponent* GetActiveWeaponComponent();
};


// Class KillstreakUINew.KSActivity_ViewRedirector
// 0x0010 (0x0038 - 0x0028)
class UKSActivity_ViewRedirector : public UPUMG_ViewRedirecter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) UNKNOWN PROPERTY: ArrayProperty KillstreakUINew.KSActivity_ViewRedirector.ActivitiesToCheck

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSActivity_ViewRedirector");
		return ptr;
	}


	class UKSActivityManagerBase* GetRelevantActivityManager(class UKSGameInstance** GameInstance);
};


// Class KillstreakUINew.KSAimAssistDebugWidget
// 0x0008 (0x0238 - 0x0230)
class UKSAimAssistDebugWidget : public UUserWidget
{
public:
	unsigned char                                      bDrawAimAssistBoundary;                                   // 0x0230(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bDrawHeadAimCorrectionBoundary;                           // 0x0231(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bDrawMagnetismDebug;                                      // 0x0232(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bDrawTargetInfo;                                          // 0x0233(0x0001) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAimAssistDebugWidget");
		return ptr;
	}


	class AKSPlayerController* GetOwningKSPlayer();
	class UKSAimAssistComponent* GetAimAssistComponent();
};


// Class KillstreakUINew.KSMapIconWidgetBase
// 0x0080 (0x02B0 - 0x0230)
class UKSMapIconWidgetBase : public UUserWidget
{
public:
	unsigned char                                      bDoesIconRotate;                                          // 0x0230(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MarkerAnchorHeight;                                       // 0x0234(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeightThreshold;                                          // 0x0238(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                UniqueId;                                                 // 0x0240(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AKSPlayerState>               CreatingPlayer;                                           // 0x0244(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EDisplayType                                       ParentMapDisplayType;                                     // 0x024C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       AssociatedActor;                                          // 0x0250(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UObject>                      AssociatedObject;                                         // 0x0258(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DefaultLocation;                                          // 0x0260(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Lifespan;                                                 // 0x026C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UKSMapWidgetBase>             ParentMapWidget;                                          // 0x0270(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FVector2D                                   ScreenMargins;                                            // 0x0278(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CenterPercentageWidth;                                    // 0x0280(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CenterPercentageHeight;                                   // 0x0284(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0288(0x0010) MISSED OFFSET
	float                                              HoverDelaySeconds;                                        // 0x0298(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x14];                                      // 0x029C(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSMapIconWidgetBase");
		return ptr;
	}


	void UpdateScreenRegion();
	void UpdateMetersAway(int* Meters);
	void UpdateMeetsHeightThreshold(bool* bHeight, bool* bDepth);
	ESlateVisibility Update();
	bool ShouldUpdateHover();
	bool ShouldUpdate();
	void SetScreenRegion(EIconMarkerScreenRegion* ScreenRegion);
	void SetLifeSpan(float* InLifespan);
	void SetArrowAngle(float* Angle);
	void OnUnhoverTimerComplete();
	void OnHoverTimerComplete();
	void OnHoverStateChanged(EIconHoverState* NewHoverState);
	void OnAssociatedActorDestroyed(class AActor** Actor);
	void IsScreenRegion(bool* InsideCenter, bool* InsideMargins);
	bool IsInCenteredScreenRect(float* PositionX, float* PositionY, float* XMargin, float* YMargin);
	bool IsHovering();
	float GetWorldYaw();
	struct FVector GetWorldPosition();
	EIconHoverState GetHoverState();
	float GetEdgeArrowAngleBase(float* Angle);
	float GetDistanceToIcon();
	void GetArrowPosition(bool* IsIconVisible, float* Angle, struct FVector2D* ArrowPosition);
};


// Class KillstreakUINew.KSAllyMarkerWidget
// 0x0048 (0x02F8 - 0x02B0)
class UKSAllyMarkerWidget : public UKSMapIconWidgetBase
{
public:
	class UWidget*                                     ArrowWidget;                                              // 0x02B0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidget*                                     NameOrStatusWidget;                                       // 0x02B8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidget*                                     DownedSectionWidget;                                      // 0x02C0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UDataTable*                                  ContextualPingTypesDT;                                    // 0x02C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  ContextualPingMessagesDT;                                 // 0x02D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x02D8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAllyMarkerWidget");
		return ptr;
	}


	void View_SetSelfPingIcon(EPingType* PingType, EPingMessage* PingMessage);
	void View_SetRevivePercent(float* PercentValue);
	void View_SetNameText(struct FText* NameText);
	void View_SetMode(EAllyMarkerState* AllyMarkerState, bool* HasBomb, bool* HasSelfPing);
	void View_SetJob(class UKSJobItem** Job);
	void View_SetHealthPercent(float* PercentValue);
	void View_AcknowledgeSelfPing(class AKSPlayerState** AcknowledingPlayer);
	void SetPlayerName();
	bool IsOwningPlayer();
	void HandleUIRelevantChanged(class AKSPlayerState** InPlayerState);
	void HandleRemoveSelfPing(class AKSPlayerState** PingingPlayer);
	void HandlePlayerDown(struct FCombatEventInfo* CombatEventInfo, int* ExpBonus);
	void HandlePlayerDeath(struct FCombatEventInfo* DeathInfo);
	void HandleOnJobChanged();
	void HandleChangeSelfPing(class AKSPlayerState** PingingPlayer, class AKSPlayerState** AcknowledgingPlayer);
	void HandleBombStateChanged(struct FKSNeutralBombState* BombState);
	void HandleAddSelfPing(class AKSPlayerState** PingingPlayer, EPingType* PingType, EPingMessage* PingMessage);
	bool GetPingIconByType(EPingType* PingType);
	bool GetPingIconByMessage(EPingMessage* PingMessage);
	bool GetPingColorByType(EPingType* PingType, struct FLinearColor* PingColor);
	struct FVector2D GetArrowPositionFromAngleBlueprint(float* Angle);
	bool FindRowByType(EPingType* PingType, struct FContextualPingTypesRow* ContextualPingTypesRow);
	bool FindRowByMessage(EPingMessage* PingMessage, struct FContextualPingMessagesRow* ContextualPingMessagesRow);
	void ChangeOwnerContentVisibility(bool* bVisible);
};


// Class KillstreakUINew.KSAlphaDisclaimer
// 0x0000 (0x04D8 - 0x04D8)
class UKSAlphaDisclaimer : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAlphaDisclaimer");
		return ptr;
	}


	bool STATIC_LoadAlphaDisclaimerText(struct FString* SaveText);
};


// Class KillstreakUINew.KSWeaponWidget
// 0x0008 (0x04E0 - 0x04D8)
class UKSWeaponWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSWeaponWidget");
		return ptr;
	}


	void SetOwningWeapon(class AKSWeapon** InWeapon);
	void PreClearWeapon();
	void PostSetWeapon();
	void OtherWeaponUpdate();
	void OnOwningWeaponDestroyed(class AActor** DestroyedWeapon);
	class AKSWeapon* GetOwningWeapon();
};


// Class KillstreakUINew.KSAmmoWidget
// 0x0020 (0x0500 - 0x04E0)
class UKSAmmoWidget : public UKSWeaponWidget
{
public:
	int                                                CachedAmmoInClip;                                         // 0x04E0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CachedClipSize;                                           // 0x04E4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CachedInReserve;                                          // 0x04E8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      CachedIsReloading;                                        // 0x04EC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x13];                                      // 0x04ED(0x0013) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAmmoWidget");
		return ptr;
	}


	void StopReloading();
	void StartReloading();
	void OnAmmoChanged(int* OldInClip, int* OldClipSize, int* OldReserve, int* NewInClip, int* NewClipSize, int* NewReserve);
};


// Class KillstreakUINew.KSAnnouncementQueuedMessageWidget
// 0x0048 (0x0520 - 0x04D8)
class UKSAnnouncementQueuedMessageWidget : public UKSWidget
{
public:
	struct FScriptMulticastDelegate                    OnEndDisplay;                                             // 0x04D8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x04D8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FAnnouncementData                           AnnouncementData;                                         // 0x04E8(0x0038) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAnnouncementQueuedMessageWidget");
		return ptr;
	}


	void DisplayAnnouncement();
};


// Class KillstreakUINew.KSAnnouncementQueueWidget
// 0x0028 (0x0500 - 0x04D8)
class UKSAnnouncementQueueWidget : public UKSWidget
{
public:
	unsigned char                                      IsBusy;                                                   // 0x04D8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnReadyForNextAnnouncement;                               // 0x04E0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x04D9(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned char                                      UnknownData01[0x10];                                      // 0x04F0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAnnouncementQueueWidget");
		return ptr;
	}


	void Queue(struct FAnnouncementData* Announcement);
	bool GetNext(struct FAnnouncementData* Announcement);
	void ClearAnnoucementQueue();
};


// Class KillstreakUINew.KSAsyncImage
// 0x0010 (0x0268 - 0x0258)
class UKSAsyncImage : public UPUMG_AsyncImage
{
public:
	class UMaterialInstanceDynamic*                    MaterialToUse;                                            // 0x0258(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       MaterialParameter;                                        // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAsyncImage");
		return ptr;
	}


	void SetMaterialToUse(class UMaterialInstanceDynamic** InMID);
	void SetBrushFromTextureOnItem(class UPlatformInventoryItem** Item, bool* bMatchSize);
	void SetBrushFromItemIcon(class UPlatformInventoryItem** Item, bool* bMatchSize);
};


// Class KillstreakUINew.KSChatDataFactory
// 0x0000 (0x0118 - 0x0118)
class UKSChatDataFactory : public UPUMG_ChatDataFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSChatDataFactory");
		return ptr;
	}

};


// Class KillstreakUINew.KSComponentReticleWidgetBase
// 0x0020 (0x05C0 - 0x05A0)
class UKSComponentReticleWidgetBase : public UKSActiveWeaponComponentWidget
{
public:
	float                                              ShrinkAnimationTime;                                      // 0x05A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotIconMaxScale;                                  // 0x05A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotIconMinScale;                                  // 0x05A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotMinScaleSqDist;                                // 0x05AC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bGrenadeCooking;                                          // 0x05B0(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bInADS;                                                   // 0x05B1(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bCachedBlockIconVisible;                                  // 0x05B2(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CachedWeaponAccuracy;                                     // 0x05B4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CachedReticleOffset;                                      // 0x05B8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSComponentReticleWidgetBase");
		return ptr;
	}


	void ViewedPawnInstigatedDamageNotify(struct FCombatEventInfo* DamageInfo);
	void UpdateReticleOffset(float* OffsetFromCenterScreen);
	void UpdateBlockedShotIcon(bool* IconVisible, struct FVector2D* Translation, struct FVector2D* IconScale);
	void CalculateReticleOffset(float* DeltaTime);
	void CalculateBlockedShotIcon();
};


// Class KillstreakUINew.ContextActionData
// 0x0058 (0x0080 - 0x0028)
class UContextActionData : public UObject
{
public:
	struct FName                                       RowName;                                                  // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FContextAction                              RowData;                                                  // 0x0030(0x0040) (BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             OnContextAction;                                          // 0x0070(0x0010) (ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.ContextActionData");
		return ptr;
	}


	void TriggerContextAction();
};


// Class KillstreakUINew.KSContextBarWidget
// 0x0068 (0x0540 - 0x04D8)
class UKSContextBarWidget : public UKSWidget
{
public:
	class UDataTable*                                  ContextActionDT;                                          // 0x04D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FName, struct FRouteContextInfo>       RouteContextInfoMap;                                      // 0x04E0(0x0050) (ZeroConstructor)
	struct FName                                       ActiveRoute;                                              // 0x0530(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       OverrideRoute;                                            // 0x0538(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSContextBarWidget");
		return ptr;
	}


	void UpdateContextActions(TArray<class UContextActionData*>* ContextActions, struct FName* CurrentRoute);
	void SetPrompts(struct FName* Route, TArray<struct FName>* ContextNames);
	void SetPromptAction(struct FName* Route, struct FName* ContextName, struct FScriptDelegate* EventCallback);
	void SetPrompt(struct FName* Route, struct FName* ContextName);
	void SetOverrideRoute(struct FName* Route);
	void SetActiveRoute(struct FName* Route);
	void RefreshContextBar();
	void OverrideKeyButtons();
	struct FName GetCurrentContextRoute();
	void ClearPromptByKey(struct FName* Route, struct FKey* Key);
	void ClearPrompt(struct FName* Route, struct FName* ContextName);
	void ClearOverrideRoute();
	void ClearAllPrompts(struct FName* Route);
};


// Class KillstreakUINew.KSContextualPingMarkerWidget
// 0x0088 (0x0338 - 0x02B0)
class UKSContextualPingMarkerWidget : public UKSMapIconWidgetBase
{
public:
	struct FScriptMulticastDelegate                    OnPingRemovedCalled;                                      // 0x02B0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x02B0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnPingChangedCalled;                                      // 0x02C0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x02C0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FPingInfo                                   CurrentPingInfo;                                          // 0x02D0(0x0050) (BlueprintVisible)
	class UKSPingManager*                              PingManager;                                              // 0x0320(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDataTable*                                  ContextualPingTypesDT;                                    // 0x0328(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  ContextualPingMessagesDT;                                 // 0x0330(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSContextualPingMarkerWidget");
		return ptr;
	}


	void SetupPingOnReady();
	void SetPingInfo(struct FPingInfo* PingInfoVal);
	void OnPingUnhovered(int* PingId, class AKSPlayerState** PingingPlayer);
	void OnPingHovered(int* PingId, class AKSPlayerState** PingingPlayer);
	void OnInitializePing();
	bool IsInvisiblePingType(EPingType* PingType);
	void HandleOnContextualPingRemoved(int* PingId, class AKSPlayerState** PingingPlayer);
	void HandleOnContextualPingChanged(int* PingId, class AKSPlayerState** PingingPlayer, class AKSPlayerState** AcknowledgingPlayer);
	float GetPingLifeSpan(EPingType* PingType);
	bool GetPingIconByType(EPingType* PingType);
	bool GetPingIconByMessage(EPingMessage* PingMessage);
	bool GetPingColorByType(EPingType* PingType, struct FLinearColor* PingColor);
	bool FindRowByType(EPingType* PingType, struct FContextualPingTypesRow* ContextualPingTypesRow);
	bool FindRowByMessage(EPingMessage* PingMessage, struct FContextualPingMessagesRow* ContextualPingMessagesRow);
};


// Class KillstreakUINew.KSCustomizationSelection
// 0x0008 (0x04E0 - 0x04D8)
class UKSCustomizationSelection : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSCustomizationSelection");
		return ptr;
	}


	void SetWingSuitAsset(class UKSWeaponAsset** WingSuit);
	void OnVendorLoaded(int* GroupId, TArray<int>* VendorIds);
	bool GetWingSuitItems(TArray<class UPUMG_StoreItem*>* WingSuitSkinItems);
	class UKSWeaponAsset* GetWingSuitAsset();
	bool GetWeaponSlotItems(EWeaponSlot* WeaponSlotType, class UKSJobItem** JobItem, TArray<class UPUMG_StoreItem*>* WeaponSkinItems);
	bool GetWeaponItem(EWeaponSlot* WeaponSlotType, class UKSJobItem** JobItem, class UKSWeaponAsset** Weapon);
	bool GetSkinItemsForJobItem(class UKSJobItem** JobItem, TArray<class UPUMG_StoreItem*>* JobSkinItems);
	bool GetRadialMenuItems(int* LootTableId, TArray<class UPUMG_StoreItem*>* RadialMenuItems);
	TArray<class UPUMG_StoreItem*> GetItemsForSlot(EMercCosmeticSlot* SlotType, EWeaponSlot* WeaponSlotType, class UKSJobItem** JobItem);
	class UKSStoreItemHelper* GetItemHelper();
};


// Class KillstreakUINew.KSDataSocialCategory
// 0x00B8 (0x00E0 - 0x0028)
class UKSDataSocialCategory : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnPlayersUpdated;                                         // 0x0028(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0028(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnHeaderUpdated;                                          // 0x0038(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0038(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnMessageUpdated;                                         // 0x0048(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0xF];                                       // 0x0048(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned char                                      UnknownData03[0x78];                                      // 0x0058(0x0078) MISSED OFFSET
	TArray<class UKSDataSocialPlayer*>                 SortedPlayerList;                                         // 0x00D0(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSDataSocialCategory");
		return ptr;
	}


	bool TryConsumeOpenOnUpdate();
	void SetOpenOnUpdate(bool* Value);
	void SetMessageText(bool* bProcessing, struct FText* MessageText);
	void SetHeaderText(struct FText* Header);
	int Num();
	bool IsProcessing();
	TArray<class UKSDataSocialPlayer*> GetPlayerList();
	struct FText GetMessageText();
	struct FText GetHeaderText();
	unsigned char BP_GetSectionValue();
};


// Class KillstreakUINew.KSDataSocialPlayer
// 0x0018 (0x0040 - 0x0028)
class UKSDataSocialPlayer : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnDataUpdate;                                             // 0x0028(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0028(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UKSPlayerInfo*                               Info;                                                     // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSDataSocialPlayer");
		return ptr;
	}


	void KSSocialPlayerUpdate__DelegateSignature(class UKSPlayerInfo** playerinfo);
	bool IsValid();
	class UKSPlayerInfo* GetPlayerInfo();
};


// Class KillstreakUINew.KSDebugMenu
// 0x0010 (0x04E8 - 0x04D8)
class UKSDebugMenu : public UKSWidget
{
public:
	TArray<struct FDebugMenuCommandInfo>               DebugCommands;                                            // 0x04D8(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSDebugMenu");
		return ptr;
	}


	bool GetSubmenu(struct FDebugMenuCommandInfo* BaseCommand, TArray<struct FDebugMenuCommandInfo>* Submenu);
	void GetSortedBaseDebugCommands(TArray<struct FDebugMenuCommandInfo>* SortedCommands);
	EConsoleCommandParamType GetParamTypeForSubCommand(struct FString* BaseCommandString);
};


// Class KillstreakUINew.KSEditableTextBox
// 0x0010 (0x0A38 - 0x0A28)
class UKSEditableTextBox : public UEditableTextBox
{
public:
	struct FScriptDelegate                             OnKeyDown;                                                // 0x0A28(0x0010) (Edit, ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEditableTextBox");
		return ptr;
	}

};


// Class KillstreakUINew.KSQueuedMessageWidget
// 0x0018 (0x04F0 - 0x04D8)
class UKSQueuedMessageWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x04D8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSQueuedMessageWidget");
		return ptr;
	}


	void QueueMessage(struct FText* Message);
	bool GetNextMessage(struct FText* Message);
};


// Class KillstreakUINew.KSEliminationMessageWidget
// 0x0030 (0x0520 - 0x04F0)
class UKSEliminationMessageWidget : public UKSQueuedMessageWidget
{
public:
	struct FScriptMulticastDelegate                    OnReceivedMessage;                                        // 0x04F0(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x04F0(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class APawn*                                       KillCamPawn;                                              // 0x0500(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0508(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEliminationMessageWidget");
		return ptr;
	}


	void QueueCombatMessage(struct FEliminationMessage* CombatMessage);
	void OnPlayerDownReceived(struct FCombatEventInfo* EventInfo);
	void OnPlayerDeathReceived(struct FCombatEventInfo* EventInfo);
	void OnPlayerAssistReceived(struct FAssistInfo* EventInfo);
	bool IsViewedPlayerStateSelf(class APlayerState** ViewedPlayerState);
	bool IsViewedKillCamPlayerState(class APlayerState** KillCamPlayerState);
	bool GetNextCombatMessage(struct FEliminationMessage* CombatMessage);
	void ClearCombatMessages();
};


// Class KillstreakUINew.KSEMODataFactory
// 0x00F0 (0x0128 - 0x0038)
class UKSEMODataFactory : public UPUMG_DataFactory
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0038(0x000C) MISSED OFFSET
	unsigned char                                      haveRecieveMatchReport;                                   // 0x0044(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xA3];                                      // 0x0045(0x00A3) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRewardsRecieved;                                        // 0x00E8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0xF];                                       // 0x0045(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnPlayerProgressionRecieved;                              // 0x00F8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0xF];                                       // 0x00F8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnPlayerReputationRecieved;                               // 0x0108(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0xF];                                       // 0x0108(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FScriptMulticastDelegate                    OnRogueMasteryProgressReceived;                           // 0x0118(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0xF];                                       // 0x0118(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEMODataFactory");
		return ptr;
	}


	void SetupTestData();
	bool IsLocalPlayer(int64_t* PlayerId);
	void HandlePlayerRewards(struct FPlayerRewardsSummary* PlayerRewardSummary, bool* bFakeTestData);
	void HandleEOMDetail();
	struct FScoreboardStats GetScoreboardStats();
	struct FPlayerRewardsSummary GetPlayerRewardsSummary();
	int GetLastMatchQueueId();
	bool FindPlayerProgressionActivity(class UKSActivityInstance** PlayerProgressionActivity);
	void ComputeEOMResults();
	void CalcPlayerProgression(int* XpEarned, bool* bFakeTestData);
};


// Class KillstreakUINew.KSViewedPawnWidget
// 0x0010 (0x0508 - 0x04F8)
class UKSViewedPawnWidget : public UKSPawnWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x04F8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSViewedPawnWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSExpDisplayWidget
// 0x0018 (0x0520 - 0x0508)
class UKSExpDisplayWidget : public UKSViewedPawnWidget
{
public:
	unsigned char                                      bIsWaitingForNextQueue;                                   // 0x0508(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0509(0x0017) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSExpDisplayWidget");
		return ptr;
	}


	void QueueExpDisplays(struct FExpDisplayInfo* ExpInfo);
	void NativeHandleDisplayExpInfo();
	bool GetNextExpDisplay(struct FExpDisplayInfo* ExpInfo);
	void DisplayExpInfo();
};


// Class KillstreakUINew.KSFloatTickLerpWidgetBase
// 0x0018 (0x0248 - 0x0230)
class UKSFloatTickLerpWidgetBase : public UUserWidget
{
public:
	float                                              LerpTime;                                                 // 0x0230(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LerpPower;                                                // 0x0234(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0238(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFloatTickLerpWidgetBase");
		return ptr;
	}


	void SetTargetValue(float* Value);
	void SetLerpTime(float* Time);
	void SetLerpPower(float* Power);
	bool IsLerping();
	float GetCurrentValue();
	void ForceCurrentValue(float* Value);
	void DisplayForValue(float* Value);
};


// Class KillstreakUINew.KSFriendDataFactory
// 0x0010 (0x0118 - 0x0108)
class UKSFriendDataFactory : public UPUMG_FriendDataFactory
{
public:
	struct FScriptMulticastDelegate                    OnUpdateRecentlyPlayedPlayers;                            // 0x0108(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0108(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFriendDataFactory");
		return ptr;
	}


	void UIX_ShowExternalProfile(int64_t* PlayerId);
	void OnEOMRewardsReceived(struct FPlayerRewardsSummary* PlayerRewardsSummary, struct FScoreboardStats* ScoreboardStats);
	void KSUpdateRecentlyPlayedPlayers__DelegateSignature(class UKSFriendDataFactory** Source);
	TArray<class UPUMG_PlayerInfo*> GetSuggestedFriends_Info();
	TArray<class UKSPlayerInfo*> GetPlayersPlayedWithThisClientSession_Info();
	TArray<class UPUMG_PlayerInfo*> GetPendingFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetOnlineFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetFriendRequests_Info();
};


// Class KillstreakUINew.KSMapWidgetBase
// 0x00B8 (0x0590 - 0x04D8)
class UKSMapWidgetBase : public UKSWidget
{
public:
	EDisplayType                                       MapDisplayType;                                           // 0x04D8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x04D9(0x0017) MISSED OFFSET
	TMap<class AKSPlayerState*, class UKSMapIconWidgetBase*> PlayerIconMap;                                            // 0x04F0(0x0050) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData01[0x40];                                      // 0x0540(0x0040) MISSED OFFSET
	unsigned char                                      AbsoluteRotation;                                         // 0x0580(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      CanBeScrambled;                                           // 0x0581(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      IsScrambled;                                              // 0x0582(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bAffectedByScramble;                                      // 0x0583(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0584(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSMapWidgetBase");
		return ptr;
	}


	void UpdateIcon(class UKSMapIconWidgetBase** Icon);
	struct FVector2D ToIconRenderCoords(struct FVector2D* MapCoords);
	float ToIconRenderAngle(float* PlayerAngle);
	void TickCachedTransform();
	void SetScrambleState(bool* Scrambled);
	void OnScrambleStateChanged(bool* Scrambled);
	void OnReceiveDisplayWidgetInfo(struct FDisplayInfo* DisplayInfo);
	void OnGameStateSet(class AGameStateBase** GameStateBase);
	bool IsOnMap(struct FVector2D* MapCoords);
	float GetDistanceToIcon(class UKSMapIconWidgetBase** Icon);
	class APawn* GetCachedViewedPawn();
	struct FTransform GetCachedTransform();
	class UKSMapIconWidgetBase* CreateNewIconWidget(class UClass** WidgetClass, int* UniqueId, class AKSPlayerState** CreatingPlayer, EDisplayType* ParentMapDisplayType, class AActor** AssociatedActor, class UObject** AssociatedObject, struct FVector* DefaultLocation, float* Lifespan);
};


// Class KillstreakUINew.KSFullMapWidget
// 0x0010 (0x05A0 - 0x0590)
class UKSFullMapWidget : public UKSMapWidgetBase
{
public:
	float                                              MinimapWidth;                                             // 0x0590(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0594(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFullMapWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSHUDCommon
// 0x0078 (0x0520 - 0x04A8)
class AKSHUDCommon : public APUMG_HUD
{
public:
	struct FScriptMulticastDelegate                    OnPreferredSiteUpdated;                                   // 0x04A8(0x0001) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xF];                                       // 0x04A8(0x000F) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UPUMG_LoginDataFactory*                      LoginDataFactory;                                         // 0x04B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSSettingsDataFactory*                      SettingsFactory;                                          // 0x04C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSChatDataFactory*                          ChatDataFactory;                                          // 0x04C8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSPartyDataFactory*                         PartyDataFactory;                                         // 0x04D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSLoadoutDataFactory*                       LoadoutDataFactory;                                       // 0x04D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSMercManager*                              MercManager;                                              // 0x04E0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSNPEDataFactory*                           NPEDataFactory;                                           // 0x04E8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bDisplayWatermark;                                        // 0x04F0(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkAlpha;                                           // 0x04F4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetLeft;                                      // 0x04F8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetTop;                                       // 0x04FC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetRight;                                     // 0x0500(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetBottom;                                    // 0x0504(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkChangePositionTime;                              // 0x0508(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	class UDataTable*                                  ColorPaletteDT;                                           // 0x0510(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  FontPaletteDT;                                            // 0x0518(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSHUDCommon");
		return ptr;
	}


	void TestChallengeNotification();
	void ShowErrorPopup(struct FText* ErrorMsg);
	bool ShouldShowCrossplayIconForPlayerState(class AKSPlayerState** PlayerState);
	bool ShouldShowCrossplayIconForPlayer(int64_t* PlayerId);
	void SetPreferredSiteId(int* SiteId);
	void PrintToLog(struct FText* InText);
	void OpenTextChatToPlayer(class UPUMG_PlayerInfo** Player);
	void LogErrorMessage(struct FText* ErrorMsg);
	bool IsSamePortalAsLocalPlayer(int64_t* PlayerId);
	void HandleOpenTextChat(bool* BeginChatCommand);
	void HandleControllerDisconnect();
	class UKSUISessionManager* GetUISessionManager();
	void GetSiteList(TMap<int, struct FText>* OutSiteIdToNameMap);
	class UKSSettingsDataFactory* GetSettingsDataFactory();
	bool GetPreferredSiteId(int* OutSiteId);
	class UKSPartyDataFactory* GetPartyDataFactory();
	class UKSNPEDataFactory* GetNPEDataFactory();
	class UKSMercManager* GetMercManager();
	class UPUMG_LoginDataFactory* GetLoginDataFactory();
	class UKSLoadoutDataFactory* GetLoadoutDataFactory();
	class UKSStoreItemHelper* GetItemHelper();
	bool GetFont(struct FName* FontName, struct FSlateFontInfo* ReturnFont);
	TArray<class UPanelWidget*> GetFocusableWidgetContainers();
	class UKSContextBarWidget* GetContextBarWidget();
	bool GetColor(struct FName* ColorName, struct FLinearColor* ReturnColor);
	class UKSChatDataFactory* GetChatDataFactory();
	class UKSAcquisitionManager* GetAcquisitionManager();
	void DisplayWatermark();
	void ApplySafeFrameScale(float* SafeFrameScale);
};


// Class KillstreakUINew.KSGameHUDNew
// 0x0098 (0x05B8 - 0x0520)
class AKSGameHUDNew : public AKSHUDCommon
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0520(0x0008) MISSED OFFSET
	class UClass*                                      AimAssistDebugWidgetClass;                                // 0x0528(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TWeakObjectPtr<class UUserWidget>                  AimAssistDebugWidget;                                     // 0x0530(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<struct FDataTableInfo>                      BaseAssetDataTables;                                      // 0x0538(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class UDynamicSkinTable*                           AssetDataTableManager;                                    // 0x0548(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMultiSkinObject*                            SkinObject;                                               // 0x0550(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UKSHUDStateTracker*                          HUDStateTracker;                                          // 0x0558(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x58];                                      // 0x0560(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGameHUDNew");
		return ptr;
	}


	void UIX_ReturnLobby();
	bool UIX_MutePlayer(class AKSPlayerState** KSPlayerState, bool* Mute);
	void ToggleAimAssistDebug();
	void SetHUDVisible(bool* bVisible);
	void ReturnToHome();
	void OnViewedPlayerStateModRemoved(class UKSPlayerMod** PlayerMod, class UKSPlayerModInstance** ModInstance);
	void OnViewedPlayerStateModAdded(class UKSPlayerMod** PlayerMod, class UKSPlayerModInstance** ModInstance);
	void OnViewedPawnChanged(class AKSPlayerController** Controller, class AActor** OldViewTarget, class AActor** NewViewTarget);
	void OnToggleHUD();
	void OnAssetDataTableManagerChanged();
	bool IsPlayerMuted(class AKSPlayerState** KSPlayerState);
	void HandleLoginStateChange(EPUMG_LoginState* LoginState);
	void HandleFubar();
	class UKSHUDStateTracker* GetHUDStateTracker();
};


// Class KillstreakUINew.KSGameInfoOverlayBase
// 0x0020 (0x04F8 - 0x04D8)
class UKSGameInfoOverlayBase : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x04D8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGameInfoOverlayBase");
		return ptr;
	}


	void HandlePlayerStateReady(class AKSPlayerState** PlayerState);
};


// Class KillstreakUINew.KSGamepadPromptWidget
// 0x0010 (0x04E8 - 0x04D8)
class UKSGamepadPromptWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x04D8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGamepadPromptWidget");
		return ptr;
	}


	void SetContext(struct FButtonPromptContext* PromptContext);
	void PushContext(struct FButtonPromptContext* PromptContext);
	bool PopContext(struct FButtonPromptContext* OutContext);
	void ClearAllContext();
	void ApplyContext(struct FButtonPromptContext* Context);
};


// Class KillstreakUINew.KSHealthWidget
// 0x0020 (0x0518 - 0x04F8)
class UKSHealthWidget : public UKSPawnWidget
{
public:
	float                                              CachedHealth;                                             // 0x04F8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedArmor;                                              // 0x04FC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedMaxHealth;                                          // 0x0500(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedOverheal;                                           // 0x0504(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0508(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSHealthWidget");
		return ptr;
	}


	void OverhealChangeFromChar(class AKSCharacterBase** Character, bool* bAnimatedChange);
	void OnOverhealChanged(float* OldOverheal, float* NewOverheal, bool* bAnimatedChange);
	void OnHealthChanged(float* OldHealth, float* OldMaxHealth, float* NewHealth, float* NewMaxHealth, bool* bAnimatedChange);
	void OnArmorChanged(float* OldArmor, float* NewArmor);
	void HealthChangeFromChar(class AKSCharacterBase** Character, bool* bAnimatedChange);
	void HandlePawnOverhealChange(class AKSCharacterBase** Character);
	void HandlePawnHealthChange(class AKSCharacterBase** Character);
};


// Class KillstreakUINew.KSHUDStateTracker
// 0x0028 (0x0050 - 0x0028)
class UKSHUDStateTracker : public UObject
{
public:
