#pragma once

// RogueCompany (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// DynamicClass PCM_Hero_ABP.PCM_Hero_ABP_C
// 0x1C380 (0x1D370 - 0x0FF0)
class UPCM_Hero_ABP_C : public UKSCharacterAnimInst
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0FF0(0x0098) MISSED OFFSET
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_10039EB244652322F5AF92866A0196F1;// 0x1088(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_90B5E1F24530EBA9DB77BCA9FF80E0A8;      // 0x1128(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C7A0EE7442111D1B9883B89CD838490E;      // 0x1170(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5175617043F742D75A66D2ADEFA784E9;// 0x11B8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0D496CDD47326C64AD79A5B1DEBBEAD7;// 0x1270(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2EB3A27E41AE7D6EF724A8ADA26EEB37;// 0x1298(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2D49006941328BC0DB05228B7ACD566E;// 0x12C0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AC2DDAFA4C9CF29A4987419A10C62352;// 0x1360(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_640792D1459CD76390D1F6974BB3D028;// 0x1418(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7B6C8429408B648B7718BF9C6721AFC0;// 0x1438(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_77196D11474B57ECE060028591CAA3B5;// 0x1540(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0CC6A1EE4D182B373791B99375E82EB6;// 0x1560(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2FECFF854DD03FC7AF87669E6618453D;// 0x1588(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_72B25BA04C1057786BD47EA1325407D4;// 0x1690(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8D9F5E8E444380B955AD369ED3543163;// 0x1798(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6F34BD91427109435035E388CB35F15A;// 0x18A0(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E989E4B14946762752903FB8FFA64F92;// 0x1940(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_EA60BACD49835DE178968C9E864EF146;// 0x1960(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C1B55F204FD17E11F83857BBA9202821;// 0x1980(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7AA08AE048F9D12719930A8EEB96E94F;// 0x1A20(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B435396A4C7845A22D1DE5A7E6DA8940;// 0x1A40(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_23DB87334A5B7D99A2FB028091C7E25A;// 0x1A60(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9D202664C14A460D625E094CFA3FD19;// 0x1B00(0x0028)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot_66061EAB4DF2E8DEF5394DAA78AA2AB0;// 0x1B28(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4F1E733A44ED52BEB638F894E6B445FC;// 0x1BB8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C9FB0C184909107565CB8E9F8CCBF328;// 0x1BE8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_624ED0644BA425836D7298B6BDBD6AD0;// 0x1C60(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9891860C4B9AA4AE3FA4D8868CC8BC9D;// 0x1C90(0x00B0)
	unsigned char                                      __CustomProperty_StringMantlesTogether_461224144FFC5A148A9487A371F95429;// 0x1D40(0x0001) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_Max2StoryMantleHt_461224144FFC5A148A9487A371F95429;// 0x1D44(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_MaxMantleHt_461224144FFC5A148A9487A371F95429;// 0x1D48(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAnimNode_LinkedAnimGraph                   AnimGraphNode_SubInstance_461224144FFC5A148A9487A371F95429;// 0x1D50(0x0098)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_87AF3B5D4F11A0D60147EAB267C57878;// 0x1DE8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_35CE09E44BB6C7CFA5730C9A6A61B2BF;// 0x1E98(0x00B8)
	struct FAnimNode_LinkedAnimGraph                   AnimGraphNode_SubInstance_E3950B524F93AEA4F112E2B3A71E8E86;// 0x1F50(0x0098)
	struct FAnimNode_AimOffsetSkinned                  AnimGraphNode_AimOffsetSkinned_054730384BD51E3E23F6F1B0952A33CB;// 0x1FE8(0x01B0)
	struct FAnimNode_AimOffsetSkinned                  AnimGraphNode_AimOffsetSkinned_3E2AA5EA4C7A1498994071B2C4727CFF;// 0x2198(0x01B0)
	struct FAnimNode_AimOffsetSkinned                  AnimGraphNode_AimOffsetSkinned_26DE6FF0456E15FEAB6926B72AF6BD7E;// 0x2348(0x01B0)
	EKSMovementDirection                               __CustomProperty_MeleeLowerBodyDirection_3741820D49F2DBC1518975A785322FAF;// 0x24F8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_bEnableMeleeLowerBody_3741820D49F2DBC1518975A785322FAF;// 0x24F9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_bCanTransitionDirections_3741820D49F2DBC1518975A785322FAF;// 0x24FA(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_MasterWeaponIsGrenade_3741820D49F2DBC1518975A785322FAF;// 0x24FB(0x0001) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_CachedPivotAngle_3741820D49F2DBC1518975A785322FAF;// 0x24FC(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_Cached_Stop_Angle_3741820D49F2DBC1518975A785322FAF;// 0x2500(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_Dodge_Rolling_BP_3741820D49F2DBC1518975A785322FAF;// 0x2504(0x0001) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_Cached_Angle_3741820D49F2DBC1518975A785322FAF;// 0x2508(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_Starting_a_Pivot_3741820D49F2DBC1518975A785322FAF;// 0x250C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_StringMantlesTogether_3741820D49F2DBC1518975A785322FAF;// 0x250D(0x0001) (ZeroConstructor, IsPlainOldData)
	float                                              __CustomProperty_MaxMantleHt_3741820D49F2DBC1518975A785322FAF;// 0x2510(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAnimNode_LinkedAnimGraph                   AnimGraphNode_SubInstance_3741820D49F2DBC1518975A785322FAF;// 0x2518(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EF41D913441B65C8AA1F9AA0269E00F6;// 0x25B0(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_91DD480E4A737FF01CF8A9820066C60F;      // 0x2650(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_49BE09A34BE5E900BC0A188E899A354D;      // 0x2698(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E153E4304E657577893FE096E50F9FBF;// 0x26E0(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F092B1064A0E80F11E70FCB59E52E0C2;// 0x27E8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9AA9328A458229310FE96BA5274A4971;// 0x28A8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C4150468459416CD7BEEB1A7E4A6B62F;// 0x28D0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D3538DA741A6E2DC5F2C2B83B8CB2EAF;// 0x2988(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1216805F4C5B39E5F22818BF1FABF314;// 0x29B0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3B205DF848B76438C04309A572EA2FB3;// 0x29D0(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_132C9D4E4E4BEA57EBD34D89B6C995E6;// 0x2AD8(0x00B8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F25FDA794D37C8F04ECDB6BB1168C91A;// 0x2B90(0x00C0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_89993AE948A96485ADCD62A8CE725A2D;// 0x2C50(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2365227C482463003C5FD8BEFA0F99C5;// 0x2D58(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FE1EA3904FA959B652BC218ED852DC2D;// 0x2E60(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CEC5F4B04B3CA0DB6ABA909A461C6EEC;// 0x2F18(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1F2D9786461CBD37AFBCCAA755AFE449;// 0x3020(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_893C18184F552184C3B0B28EECBC6517;// 0x3128(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0A5E0EF8427E2F05CAC17AAA0C78A949;// 0x31E0(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AE79B6CC46A31B2A7D73498874087E05;// 0x32E8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E607D2A24E7D3932066CE0922F2693B7;// 0x3388(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6341F63F465B59B0AFA6E59E1CC655B1;// 0x33B0(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_72640BAF4E1BA30E6914C3B9C3DE123A;// 0x3468(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0D7BD11C45AEF5BBE8F1A4944507B77F;// 0x3508(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DCE23BCD428E874E10AA00B42369D5D4;// 0x35C0(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9EF5277744514CEFD88A2A853EDC2F0C;      // 0x3660(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AACEB334450C70B9AB59B383B05D38F7;// 0x36A8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A51DEFB24D1E03CBD47687AB20DE37FA;// 0x36D0(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0AECAB1B4C7C4EBE62D196846EE6DE6B;// 0x3788(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_502CFD1F435472CACC69D497B09621E0;// 0x3828(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B81CC6954F274B45B50303B5E9BEAA94;// 0x38C8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A6769E8543B24EEE49A7F7930CDD1F7E;// 0x38E8(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_50B0FCEB4608F59550804B94B188ADD4;// 0x39F0(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0363619B43D78FB463FCEC870CD8EB18;// 0x3A10(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_396DFE014C2F6F59C4A7A0825F6AFC9C;// 0x3AD0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B95880D747E0C2F110A336B26A2C92C4;// 0x3B88(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96C205944D27E2CF34DAF4BF954134DF;// 0x3BB0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_17B61A5A4C26F6791298C29059178A3A;// 0x3BD8(0x0108)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2F45D03B44EBE9BEC868879280AAEE95;// 0x3CE0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_257EFD5F46255D56935D619AABF9E3D6;// 0x3D08(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A4E6613348E2D26BEB8916BEB80FBD18;// 0x3E10(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D49CA8A34D6BC20BF881288FAB4BE9CE;// 0x3E30(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_13F3A65D43CE12E3EC21F7A198F9372F;// 0x3E50(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3E5729FA4C30601B4EA872AA477A9AF6;// 0x3E78(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_55D62979448985CC1E52EBB3E6DA293F;// 0x3F80(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_EF12421D4946E44E8BAF5EA103DFFD4B;// 0x4020(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A5C11986460FED22ADC7799DE68958A2;// 0x4040(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_83E447864B6836DB1F86698C6B61E534;// 0x40F8(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1AA552A24611A69B53D0D9BE9433A275;// 0x4118(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_546EEB534233720A18EDA986ABDF4A05;// 0x41B8(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_08FBD69A410A73299FB44D8C2271DF87;// 0x42C0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5E554EE141DB3C9468523A8ADB917DCE;// 0x42E0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8AAB05E44B076B34F426419E30D8A94E;// 0x4300(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_616C0E5D4D0B3DFDF473B2B5F1ABAD47;// 0x4408(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5254C6B848532CA5CB71FDB49597E135;// 0x4510(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6ABA6B1C45F8A7901310DB9A072C500C;// 0x4530(0x0020)
	struct FAnimNode_AimOffsetSkinned                  AnimGraphNode_AimOffsetSkinned_483032354357A1D93B9AA6A6272C6FD5;// 0x4550(0x01B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F21A158A4EF9C8358FB56CA54AFA145C;// 0x4700(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_100CC6B8424C6156C57722B5B7553249;// 0x4728(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BBF52B5E4841D084ED8B1E87EC2E43A0;// 0x47E8(0x0028)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_6B1CA0A4403368401EC827B2F431EE2F;// 0x4810(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_35A006464D881424EB8CA28074704DA4;// 0x4858(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8DAE8D3D4C4EE1A9367E8894EBAEEA5F;// 0x4918(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5491CA5A4C73A2DB3629D1BB2263E1AF;// 0x49D0(0x00A0)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_8B079BB447A793E01951BB91F3572632;// 0x4A70(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_594FF7C841EB99BB25899F9CED9E6943;// 0x4BC0(0x0078)
	unsigned char                                      UnknownData01[0x8];                                       // 0x4C38(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_A4AFAC1D49380A40A17F2186DB57831F;    // 0x4C40(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C6F784D24DC9834B5E790BB95267B6C2;// 0x4DD0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F54B02D041A7DE073D70EEAC050F034F;// 0x4DF8(0x00B8)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_F7B0A0C04AF43A05D6F4A5A78F524232;  // 0x4EB0(0x01B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F8B6B5944EA74625ABF672A62734437B;// 0x5060(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9C6753634E501CE31627B9B1456DD389;// 0x5118(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F232C7DC4310583724E3F1A6797C99F8;// 0x5140(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8D50DF9042E0039C3E23B58EFBFF2CB0;// 0x5168(0x0188)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9296DBDA455E2393EDDB5C8058554032;// 0x52F0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A760CD104ED5575D963F38918812F2DD;// 0x53A8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_39CD710D487379CDBC27A39B57289FA5;// 0x53D0(0x0188)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BED93A0C44BD6D206E1DC084F9DF8354;// 0x5558(0x00B0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_E98A07AD4B614D514B072EB8CF4A846A;// 0x5608(0x0188)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_70C3734F407F1F526F31CDAD292DA169;// 0x5790(0x0188)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_C15902EA4E1F93C3E1DD28A6F847A151;// 0x5918(0x00C8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E41A5E064D7B9CEE603D3989B5481D3E;  // 0x59E0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_CCA0ECB6484936DE57A9EF9DA4B62B68;  // 0x5AD0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_095B4A2F43BCEDA4F797F38FDABFB478;  // 0x5BC0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E5C6E047422E18EDCA1145AE60D8C96B;  // 0x5CB0(0x00F0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8BEFFA054046E694EBD1A091FF1C8A83;// 0x5DA0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FC82123D40B78689DEF0D4B6AF66E290;// 0x5E58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_609E0FAD43E7D303C584D89C4119D730;// 0x5E80(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_28DC02674A065F6DC987A29995F55D17;// 0x5EA8(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A119C4E84DE1F48A8A04F8B33F29E80D;// 0x5F60(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_49BCC8ED42F103C118A8748018426116;// 0x5F80(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_972152654D22576C46C1D49BC2C0F59A;// 0x5FA8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_58A78D804741B72909B0798FEF81701A;// 0x5FD0(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A5F510524A38B24AACF2C6920C7D73B6;// 0x5FF0(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6DA0BB3C457990D02E54D488053159AD;      // 0x60A8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4AC649C94D9CA0384478F38B9984233B;// 0x60F0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9A7F40574FC55C484D04EE82337CF468;// 0x6118(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7812BEF64CD56B3903BA80B919EE97BB;// 0x61D0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3AB1BBE547504AFFE2BB9082131B7251;// 0x61F0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7EB98B1E4A43A93873ED81B836EF7636;// 0x6218(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D4F3963E4BDECFDEBE6701935A128E2F;// 0x6240(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3F16E4F44BB13DF8122740942360FF9B;// 0x6260(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FD1C2C424A2DCDCA188E6A80C0200BE5;// 0x6318(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1FA6CE1F490B82185A2C769ED18A093D;// 0x63D0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B655D0364C7E96BF92BAF9B7545615EF;// 0x63F8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F6299F1A43C04A30DE69B8A53B070E53;// 0x6420(0x00B8)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_6A33A0B8496B91B761212BB245C8A8C5;// 0x64D8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_674AFE7C40E37E3A07AACB90EC5BF223;// 0x6520(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8E62C3744F62F00D571DF68D4AB563A5;// 0x6548(0x0028)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_E9C4746F4D47188105203FB76F5CCEE6;// 0x6570(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3E549B554E2740DD071F6A9D2AE2B6FC;// 0x65B8(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3794035C4BAD5DE3903A65A064CEFEF5;// 0x6678(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_72BDCC1F4A1B409BE0020299BA8CBB9F;// 0x6738(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_67E8D29746DB8E89C3CA8387E805E9F2;// 0x67F0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1A1E130C42ED8B35221502BB4AC4AE77;// 0x68A8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8A8ADE254DD5771510F90BBF24DF8C36;// 0x68D0(0x0028)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_2EEC3AB84FA93F2AF8A63FA07E629FA6;  // 0x68F8(0x01B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4FCD5765415D05B41266F19E3FF1FEA3;// 0x6AA8(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E9B1F7564515827256875AB5FD3AD87E;// 0x6AC8(0x0020)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_FBFFF82F42A344B2BCE739A91A3AFE28;  // 0x6AE8(0x01B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B2FEBBEB4BC1E9F044033FA853A13F2B;// 0x6C98(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0BB1A05D47D1E7650426FD91DD9199CE;// 0x6CC0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BDEE1F0B4A040C50F51F6190780B40C0;// 0x6CE8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DD11D9A641EEDCE1CB611D83B3F07F36;// 0x6DF0(0x0108)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EC85EE9741194347630692B39D663998;// 0x6EF8(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8F3E94EA414799D9EE3451B3C00ED9C7;      // 0x6F20(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66ABD91E43861D29F085B7A47CE911C1;// 0x6F68(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_167DBF7043772AE51E044B9D12420127;// 0x6F90(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0D031F434EECC5C946CC4E885A63769F;// 0x7048(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4F48809B4A017DD90BD976B66F05A7B2;// 0x7070(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_00892BD44C63050236FBDA8A365449EF;// 0x7098(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6391226944968A4D58CF40BA1FA20CD5;// 0x70C0(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_6417D7484E76FBE66BFD509410D8CCDD;// 0x7160(0x0188)
	struct FKSAnimNode_Mirror                          KSAnimGraphNode_Mirror_239E648B428399781C61AEA4C3EB2E30;  // 0x72E8(0x0110)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0E3DBA2F4E726E0245CD3D98F8E30D6B;// 0x73F8(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4680E557432A495E093223A0035E00DA;// 0x7418(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BAE9A17D40662CAF9E691E83B4482E5D;// 0x7438(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B47E3085474A0939D79B328993595F59;// 0x74D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D0EB186A466945BF397FA7AD0864A5EE;// 0x7500(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A0F9872444331B64354BF3BC2CC67B1E;// 0x7528(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8283E5CC4D50FD3C715BBFB105C05AAE;      // 0x75E0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5829E23348B72201A3F1E19AB4C78443;// 0x7628(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4B847CCC454A672261B9249B039D226F;// 0x76E8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FD783E074E79C7C9E7D7478716122FEA;// 0x7710(0x0020)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_981A6D344DFB8C506B66B29AA2EFDC59;  // 0x7730(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_A73B1C72497EF9486CC58984434E4263;  // 0x78E0(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_0B3F24974CDBFBE8D9ABFA92A6B11503;  // 0x7A90(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_8D64C0ED46EDD23FCC5F39A7EC2682E5;  // 0x7C40(0x01B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CA57C8FC46815E4FFEC3B8BD22B16BBD;// 0x7DF0(0x00C0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_E4AB965E4736FA8507E6D6BF55EFE76D;  // 0x7EB0(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_1840D5D54F057B4F8086CEAD7334F792;  // 0x8060(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_FD7D9CE7461C3754665931BE071B1140;  // 0x8210(0x01B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_86525AA14966F4D06FEA9C82B5DC6C30;// 0x83C0(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_15BC312E48C785CFACBF85ACB94818D6;// 0x8460(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C8FF764741C8C1801B633D927AAA1C99;// 0x8480(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BDB779644F4A0FE3065FB48535D18069;// 0x84A8(0x00B8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1EA8A6524789048FEBAB0CA19C91EB96;// 0x8560(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_37EADC11402B3073BEF5C7B1E5141800;// 0x8610(0x00A0)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_2CD2B74F48DCF22F74C8BFB4007DF3DA;// 0x86B0(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_148343F843BE8FC21C8EBCA865FC581E;// 0x8800(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_B1A3D0524F11D2C5A4FD3CA880D32AB5;// 0x8878(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B9621EA84D2B5EE47F56B9BA21DCE843;// 0x89C8(0x0078)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_084D938944E50A9B138D3688EAA71FBE;// 0x8A40(0x00B8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_545679D84A67FFEB664C26AF30901890;// 0x8AF8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28C7CAEE4444AEDB5C5144BEA9AA40BD;// 0x8BC0(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_FC90AC3A4F8F324293B348BED0DFB85B;// 0x8C38(0x0150)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C0C107A24C2E4D79C95E72B8F7D013BE;// 0x8D88(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_86B67A25407DDA9FDC579FA3799E9C0F;// 0x8E28(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B7331B2F4EA75ECC81B7109CF13FC21B;// 0x8EF0(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_64EE9B224ACFDC850A941895B9566A1F;// 0x8F68(0x0150)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6290EE5D446D3628ED9972809C2AD310;// 0x90B8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F5A6F6F64FDB3568AE5963AC8D916310;// 0x9170(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A32B92304041C10C94E029BBBFB324A8;// 0x9198(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CEFFAC554F8F0DE95BB913876CE1F191;// 0x91C0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EF33D357412E1C963A1EBDA7341F6861;// 0x91E8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_692BBD8D4768E323966D879C64057C17;// 0x9210(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AF9E891C4192C91A37F290A6A1029D80;// 0x92B0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_927387FC4244647544506A912615A306;// 0x9350(0x00B8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AE3B57BE4B0EAC0DFB7F60A592E978C6;// 0x9408(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_349E69E94AB578E14F8D98A87C53EB12;// 0x94D0(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_1402D3A340975D93A8C10FBECC32538D;// 0x9548(0x0150)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B6A9EFEB4B5B1404C5ECECAA56BA89DB;// 0x9698(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BA4C57954B7D3FBD7EEC018A7B471AD7;// 0x9738(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC4008E5475D8137CDC860B41AEBC9B6;// 0x9800(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_F6A3C3A54BA12DB5772DE0B9F65CA063;// 0x9878(0x0150)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F41EBA004CC4EACFCBD40AAECF288BA4;// 0x99C8(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A02AE4024E728B76178E3086E351D6FE;// 0x9A80(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7A9E18DB4B95047329912CB3F7197C4A;// 0x9B20(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_78F2DE1F459C8D9694C7CD8BCC5E8508;// 0x9BC0(0x00B8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C9125F3944C04480DB4139872B99A2F3;// 0x9C78(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8BA69934E0C2D05D3E99D8A03381B9E;// 0x9D40(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_47DFE3A748ABF4374D46A3BAE244EE9B;// 0x9DB8(0x0150)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_33AF996348C2C101C5B31EA20A1DA24D;// 0x9F08(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_441E37394D8E911A6E419183E58F4C21;// 0x9FA8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44EFB3754A7E657B5583B59F0089AF4C;// 0xA070(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_29C76E7A4C520E957DE1F0A30EC539A8;// 0xA0E8(0x0150)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_73ADA39B42A51904770A7A921B65D2B2;// 0xA238(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_19F22F864B0FA7B75B0C6E81B25B077E;// 0xA2F0(0x00A0)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_F7F6EDAB407C4D447BB39CAE4188735B;// 0xA390(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_517345B549A7ECFFE38A71A3D331B28D;// 0xA4E0(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_C304C3764DC6738CB21DB1B419AD4758;// 0xA558(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_191A901D4889D85F8AB9E2B20DFD4672;// 0xA6A8(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_9658C4D844EF19690822F498563FCAF7;// 0xA720(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7ACA1B24EAB9BFA928DB395A3E1D9D6;// 0xA870(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_45C244F340C63778610F06B037BF896A;// 0xA8E8(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9CD083CB4BED33EA8323D495E8089FF2;// 0xAA38(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F0F4FC324999149B794750990ABBEA73;// 0xAAB0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_73228E1840A9C7F05B89AA9A00B0695C;// 0xAAD8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BA13FD8F40F569D6B72BE09C194040B6;// 0xAB00(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AF9718BD4EDE8ACEF55D69A177E7A4AE;// 0xAB28(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_398F7E81427F4AC733998A9BD5ACF1C6;// 0xAB50(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_87DF01DF45984399EEB1D7A5231C36DE;// 0xAB78(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_485E210B4E069AEA2287C3B224BD1534;// 0xABA0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CC23307F45716E41FCD38B9640E6F3DD;// 0xABC8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C48A122246E3F9380233909F31564CB2;// 0xABF0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6B8067234FA44B21A136808FD452798E;// 0xACB0(0x0028)
	unsigned char                                      UnknownData02[0x8];                                       // 0xACD8(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_3C6688FA49517059917AADADBE9FACD6;    // 0xACE0(0x0190)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_D5AACB724B4D68DB61948095BD730F4E;    // 0xAE70(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AF252B4F4CBE3C400AEB8AB4400253DE;// 0xB000(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_53AC59AB4DC9E8E7376B91824228A49A;// 0xB0A0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_13D35E9548DCC8AA0F765B859F085BF6;// 0xB0C0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E12CF8614C7DF1AE08918288ED352492;// 0xB0E0(0x0020)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_50FA8F9B460C17132C2E20B2DAFC4F21;  // 0xB100(0x01B0)
	struct FKSAnimNode_Recoil                          KSAnimGraphNode_Recoil_6BD0C233490D1BFEC2BB7BA1BE26073A;  // 0xB2B0(0x01B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4DAC0ADB4DED25F57E539699C08E7875;// 0xB460(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5BE4C7A54306B27FE50057A44EFE885E;// 0xB500(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0B7D946C4F2AD31BB0EF28B76D3519D3;// 0xB520(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_75175DD64323C459FC38999FB41F2CD6;// 0xB5E0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AF44A8B84A9569A1A28906BE15E555CC;// 0xB698(0x0028)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_B8C31F2A4D4864DBBC585DB5FD8C6CFA;// 0xB6C0(0x0150)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0F751E6540C9289E4B77DA8F2E70D176;// 0xB810(0x00C8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BE84A33C45C42AD6DFBA86A55F437303;// 0xB8D8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C86F8B7434017908D1B22A90146FE83;// 0xB990(0x0078)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2B595A1C417E62E30026CD99DBB7A615;// 0xBA08(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96C3D1CD4667CEE77290C2A26E5410CE;// 0xBAC0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A0DA7D924E5CA5052ADAC6918FFB772A;// 0xBAE8(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B34F4DC247E5292025DF26BB015DAF7D;// 0xBB10(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9F4F329240B6C23894194DAF247117B0;// 0xBBC0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3EFD00F846963B003CDB4AA2A03F6B33;// 0xBBE8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3E4CDD5A4DF1DE38C9DBF2B95F464A89;// 0xBC10(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FD71A0C14E35227DC9DB638007258E89;// 0xBCC8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F8ECE71E40034351F2C0959828503444;// 0xBD68(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9E89D5C245459D674ABAA5AD32C16D11;// 0xBE20(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4A1D7116410F7918837F3F879842BD36;// 0xBE40(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_EF913C464DAA9DD46AE1BCB20E851471;// 0xBE68(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EA364A2A4E22FAA55D683E9CF4CBAA1D;// 0xBE88(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2A2ADC99485DB767647E49B2EBE0829E;// 0xBEB0(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BA9AC0354132D43AEAC07CA6DD8F4AE4;// 0xBED0(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A34EF15942AB3FDB403AB18588ACCE14;// 0xBF88(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2867EB964341FA8A652D1DA877ED782E;// 0xBFA8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9A7DE0434358B7EC58B4ADAA04DD1F95;// 0xBFD0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F574DC5C4A1356CF92B78E9641477CE2;// 0xBFF0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_767564F14531A429F54DC097BDEDC11B;// 0xC018(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45CB47FE4C3AB48BD540A599101D7625;// 0xC038(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B411E6184176C6154417FC8DAFB49D35;// 0xC060(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AA08429D416E45AFBF28A88AA8C10ED1;// 0xC088(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_48B722A643413B022EDB62B5568FD5DF;// 0xC140(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_464B14D04B163A36BE57F9BC53DB272E;// 0xC168(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CCE0008643FB55F60BA04D85B43AF3E9;// 0xC190(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B1FDCEBB47D864054B948ABAC846690F;// 0xC1B8(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_92F80AE9484A5C14C4E75EB862811C61;// 0xC1E0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC3404844DA1D3C1322762AE219F6D75;// 0xC290(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0D0D882F4D8B4968E40DE58D85883275;// 0xC308(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F48B7FA846725D0C6CEE44A0F3CFF268;// 0xC380(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3E20A9AC4CD75644B9FFF79A67A77879;// 0xC3F8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8746FEEA43980FC2F65C9DA47BD6C683;// 0xC498(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0B8FD2D64DEA37A39BF510A97F6DDAB2;// 0xC538(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_49B12C564F17AB334FC320879918BDB8;// 0xC5D8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_76890FF74A153F91795638852D54A70E;// 0xC650(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A321E6647AD00023F8013AC2102F39E;// 0xC6C8(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5BE8C05A4EA4C35E26AB26A58E948E5C;// 0xC740(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5A2258D943F9D18ABFF11E93E62E97F2;// 0xC768(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_67EBD58F48694571EFBC75A3A90301EE;// 0xC820(0x0028)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_85C418BD4D92AD0019A359A680FBEC0D;// 0xC848(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_D9A8F02445BEC14ED37363AF601148CE;// 0xC998(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_72044BF0499E98A30B2519A8FB9856E3;// 0xCAE8(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_2D7A52FD423B6695DB97DC83165DA60C;// 0xCC38(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_E50367584DD287BD70EEE080290E9755;// 0xCD88(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_E9BB61B140A3E46CF1F4A69E598C88E6;// 0xCED8(0x0150)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_AF84DBE345D2527904FDB6819611BB25;// 0xD028(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BA1929D54B3B09856192B4B7A4D3B8A5;// 0xD0E8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6F772F0A440E8216A0467DBF72093D9E;// 0xD188(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1659FC45484D536FE4E7ABBEDD774F33;// 0xD1B0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86EEABEC4BA634AF6F4BEBB1337D702D;// 0xD1D8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D8225E354E5AAFBD6D01499A06EF65D3;// 0xD200(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D10D90146BDA6AA7201B88FC93EE65E;// 0xD2C0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_702C3C4F40247984E2D2268AD71D43A3;// 0xD2E8(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CC6BB8114B89F4044829939794387FB5;// 0xD310(0x00C8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E06D160748A0690CA1789395FB77E201;// 0xD3D8(0x00C0)
	unsigned char                                      __CustomProperty_bIsLobby_9FDD1A7146055937A755E6ACD99BC318;// 0xD498(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      __CustomProperty_bIsServer_9FDD1A7146055937A755E6ACD99BC318;// 0xD499(0x0001) (ZeroConstructor, IsPlainOldData)
	struct FAnimNode_LinkedAnimGraph                   AnimGraphNode_SubInstance_9FDD1A7146055937A755E6ACD99BC318;// 0xD4A0(0x0098)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_324BE7CD437C0C09CC6DADB2E7E8D835;// 0xD538(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1289CEB142693090D4B915BA3FB44373;// 0xD5F0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AABA7ADA4260B7DDD65628A5F9496BD8;// 0xD618(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F8E90D624D191AF89DE5BEA8AF30C631;// 0xD640(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AA36776F4E43A43E8EFC8ABE442510AA;// 0xD668(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8F0F87EF4AB2AA6ECC6F74882B7876DF;// 0xD720(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DC5EB4404BC6F91BF7850083D3A55936;// 0xD748(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_618F49334AEBB11A37279796B17CD209;// 0xD7E8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CEAFD8540FD164BB27659BE155C715E;// 0xD8A0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C1E5A142489BB88894113EA39DB3501F;// 0xD8C8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7214FDCA4CDEA158F0337F9698959B84;// 0xD8F0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CA659A42476334C02EC60E8F55F23F60;// 0xD990(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C0E3FDCA4D5AD2CB79A4D5B8AEF5EB57;// 0xD9B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0D4CAABE478F3DE1FBAACD9211DE01E7;// 0xD9E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6346CF4F450910D84095FDA1F0BDA3AE;// 0xDA08(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7D8550034AA518B8183F1B81F9DC4531;// 0xDA30(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7ADD039E489BC0E4E50BAD8810E458D4;// 0xDA58(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CBDAD4144F3B873DA92F00A5883EC5DE;// 0xDA80(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D36E80F54668A7F9FDC9828944674215;// 0xDAA8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_90C15C0340194A546EC56CAE3524BB18;// 0xDAD0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2D0495E346BF84CB86C094AF0C885E0D;// 0xDB70(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3E6F029D4FD67D57CF2B0EAA3F67385D;// 0xDC10(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A2E420E4446461433C6633AAEBB1C539;// 0xDCB0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_62D967A34B93EFAFA144BD8858C88007;// 0xDD50(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_109CDFF74B14EC9E0C536499ECE574B6;// 0xDDF0(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2C18E4B94BD205D750DE648EF7F6B8F6;      // 0xDE90(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_082FCBD1453DF31E09195194FF9F649C;// 0xDED8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F91373C240BC28145859058DB0B4C38D;// 0xDF00(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F9750F1C49EBB64B555889901F88D1EC;// 0xDF28(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3B04A46140913E8161DA6FAD18903F34;// 0xDF50(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_79BF939442A318D00BB4F6AC729946D2;// 0xDF78(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5AA7EC0A450D3796593A89B2D5EFF334;// 0xE018(0x00A0)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_ECABE29E4511A8EDCBCFB39321D7EB41;// 0xE0B8(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18EE7FBD407A243F719824A6DCDC3BF4;// 0xE208(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_B07914034DE9640E08705C94EA0C4C85;// 0xE280(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03763DDF409A704271F89F9BC5F904A5;// 0xE3D0(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2B2B63224E4A2E8EA52B44864988462D;// 0xE448(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7439DF0A49D361E1B2E92BA8CD44DD37;// 0xE470(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9009A9B147638237B3AC8FAF31CBB541;// 0xE520(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_D107525D4933CE74C8899D9BD3CC2AA0;// 0xE548(0x0188)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E028EF2646CAABBA4677D6BE2F6ACEB8;// 0xE6D0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_284D2CCA47CF743DDA4FD0920673BAB5;// 0xE770(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_286065284045EB362971A8B1162DD12C;// 0xE798(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8F6BF45840592C01EF9CB483C9EA0B30;// 0xE858(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E487E6F44971D75845C0F2B2F3C8AA41;// 0xE880(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9CDCAB7245BCB7E7A0E2ADB48C81B83C;// 0xE988(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1C89AE3143C41C221975479494905A35;// 0xE9A8(0x0108)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2E050BFC4D986D563525A2B520501D8E;// 0xEAB0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_39620016430E52D25A758681D605A5BA;// 0xEAD8(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2378DF1544893F8AABD03EA408A75A6F;// 0xEAF8(0x00B8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0085E2E14C33382245437CA06DC783CF;// 0xEBB0(0x00B8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_81A7F7B4431EB312B3929286460A4731;// 0xEC68(0x0188)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3E0AA0E74F676B0AF22FD7B547C65E5E;// 0xEDF0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B53CF1184248C0C3D1A218906F17D047;// 0xEE18(0x00B8)
	struct FAnimNode_RigidBodySkipServer               AnimGraphNode_RigidBodySkipServer_63EF19E64EAD1AB0C29DFE810FC322EE;// 0xEED0(0x0560)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F311E29B47376A75F7CADA885AC60D50;// 0xF430(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8B2AB9A64C772A21AC11AD97585A47D3;// 0xF450(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DB5B69824FAB9954764688AB618A843E;// 0xF478(0x0020)
	struct FAnimNode_BlendByLOD                        AnimGraphNode_BlendByLOD_97102D4A414644A5DB51BABBC2D1BD48;// 0xF498(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CA2EA5074C4422408D26B7AB05937E5F;// 0xF538(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2DA445B5420ABF25896ED9A047DE3AA7;// 0xF560(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B60DB0C2476CE26BC38E85978156C863;// 0xF588(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C25ECE3D48B7F2D088FE399B94413233;// 0xF5B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EC4576B4419196162338EB146564905;// 0xF5D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_928BF07A47B3335F07F0FEBDA1AEEA49;// 0xF600(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B9ACF614D7FA965A4FAE0ADBEB82AD5;// 0xF628(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C07F39748AE158DE081A1A83BB697E8;// 0xF650(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E8F5864A4FBC518801ABE9B4B8E01DB2;// 0xF678(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_219B6DBB4BB00EFE58CA34AE02A87030;// 0xF6A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F88837142168D1B73A6A1B2A0AD3830;// 0xF6C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7EE32840456D5D28C484B38772C5014A;// 0xF6F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7768F70149EF6298739C1C9FEDCCBB0C;// 0xF718(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C8AC5B34006A5CA8EF81A80D4218120;// 0xF740(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A71A137D45979E49935FD59C46E68895;// 0xF768(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33E027DF46DCE517828E04A253364A0F;// 0xF790(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C782415A492B209F167F4E9CCE170249;// 0xF7B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E471C2EA41D54CD0DBC13F89A50DBDD9;// 0xF7E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_223977B248EAF97F0D1CF197C85E2617;// 0xF808(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6050A0DC43BE6A9525822487652B373F;// 0xF830(0x0028)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_2F1824E5469862769ABCCEAE70A1F93F;// 0xF858(0x0150)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_B7594D8F4EBF70CB60FEDA93A352C253;// 0xF9A8(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_37906F5F492BB9398CB5C894999E8B65;// 0xFA70(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_1664C9B047418682610522AFE240D85D;// 0xFB10(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1888317840C6DA4D8814B18BC7223E23;// 0xFBD8(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_2B6F1CBC4C2456E3A35C98A9A9DB3A18;// 0xFC78(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_299A235045F7CAFDDC18FFBABC71DFF6;// 0xFD40(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_A561537C423FCB2B72E874913410A648;// 0xFDE0(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8E46CD0F459017238E79DC91DFAD4E63;// 0xFEA8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_933D26B8456AE00A739D7C98D974D374;// 0xFF48(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DB4C432549DE1A6BAB3C1F8D8904E6C7;// 0xFFE8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8911E5B4E600985A2D98B83E8DB8C85;// 0x10060(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14D88D9D49BCC7D8FB2EA3A5D54C19FC;// 0x100D8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_959813364922882559CC819A16CDAE79;// 0x10150(0x0078)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_BD6CEAD44C46308A607440A4F4DF0BB9;// 0x101C8(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_D13E20204B18754FCD8C1B99A42A7A57;// 0x10318(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_129C45BA4BA9A6D9269D459D0221DCAB;// 0x10468(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_2191351E49C1C60C011DE3AC7ECC8F7A;// 0x105B8(0x0150)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_657EF8C042A6B773FF10C19883D5DE56;// 0x10708(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A84676B74AFF6C9E33195FB08136D345;// 0x107D0(0x00A0)
