#pragma once

// RogueCompany (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// DynamicClass Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C
// 0x3F30 (0x4F20 - 0x0FF0)
class USub_Hero_ABP_Swimming_C : public UKSSwimmingAnimInst
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0FF0(0x0028) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6365BFCC4C7591A5B093198C5CA9FF8D;// 0x1018(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF7D86144FD18CE97CE850A0C3620FD6;// 0x1040(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB48BA754A150DD0B68FDEB6143F8C28;// 0x1068(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3BF42E04C99D31FBCA4D3AFC7973064;// 0x1090(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_131305F54923CBAAD2ECACAF3945B3DC;// 0x10B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B29AAAF44C7BC37AE81E2A03FB98EE0;// 0x10E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5D70A1F49036F86E187EE8C571CB2DC;// 0x1108(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_412E9E2342DC09D338E7689E4AE3F409;// 0x1130(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA9EF61A495651544A5BA4AFFA755093;// 0x1158(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3E49F7F454B47E501D44EA073EE26EF;// 0x1180(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63F98023469F15F4E5D075806E6B01F3;// 0x11A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C20C7B848FC539A18F8F09EE074C0C6;// 0x11D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B9CE16F475FDB9572803197918BAA61;// 0x11F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDD270D34439CCC54F7076BF79F86501;// 0x1220(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B7BB2FD4D5F14051D3988B2E1051572;// 0x1248(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C383F92B49670B60382C5A9FC1940F6D;// 0x1270(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AFB0DB7640628CC60CE90A88F7D7B406;// 0x1298(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48C425984D75FB1F21757BAEDDD2E2B0;// 0x12C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01DF78A64F399D3147CEBFB5A62CE2E1;// 0x12E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE0E9542450071A94C62FDBD42945191;// 0x1310(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC8B8B024570B5D19C3E9BABFD02106A;// 0x1338(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B8DBD004F9A9F51037D04B9CB4BB5D6;// 0x1360(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2D7D736421F594024F7C2AF55FCC2EE;// 0x1388(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B223D50A4F3B4C41684F9E8177A8F7A1;// 0x13B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32A8E5E6412D3B7482403D8CC76189E2;// 0x13D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD5472394057FF2F92436AB44DC691B1;// 0x1400(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10CC17F94E9FC40609685BA8E8696FD5;// 0x1428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A8F60B345D2BCC08EA3789A0068E76B;// 0x1450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2208B5994E350E2087383187EF43E431;// 0x1478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_938C84254015E9783201E49BF3DF9465;// 0x14A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE2D32B1481E672703161D88E16C4293;// 0x14C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35CE07414E66C5731CDC05BDE1C3FF54;// 0x14F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C49A16B641148CF5EAC0AF962C213E99;// 0x1518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_069CC5CC44770AEB005A73A9D24ABCB8;// 0x1540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD2DED7F48512B4A32546385E8563764;// 0x1568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95C6DD65471AC754B7443CABD78227E5;// 0x1590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_467FC8FF4F9F95D42A27558422FD5698;// 0x15B8(0x0028)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_9A4FDE2A40DF6D032572FEA157FF3C4B;// 0x15E0(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B48F3AAA406802512F2B58AB9B138A27;// 0x1730(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1D4E66E44C342597ADEDC6AECFF5A608;// 0x17A8(0x0030)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_9118A6D64BFDF3921A8955969D8E81D6;// 0x17D8(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_99060BBF4753302E116042BACF6CE403;// 0x1928(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_2282C0704AD90952945A3FA27CB41185;// 0x1A78(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_1D1C932E46FC71B4916A7A95CD68C728;// 0x1BC8(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5246D6494533AF804AB652B1A86A34BB;// 0x1D18(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_DAF14B4B4B8333FABBF358A49999E8D3;// 0x1D90(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_417C216B40B86002A5613DA5D7307CF8;// 0x1E30(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_603EDB464FFACB0FE0AAAAB73AE14C88;// 0x1EA8(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_9E589FC04A148FF3686CC28EC92AE41E;// 0x1F20(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E51A3454F9D9BEA4EE790B23018C659;// 0x1FC0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BBEF757346850EE6272CA6BEF3780FF5;// 0x2038(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_42B7E4A349F6572FE51FD9A0E6870C7C;// 0x20D8(0x0030)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_7A5EFBCF45912A6B4154A98EFC8AA36B;// 0x2108(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_8525218B449EEEA579904990BCFAE525;// 0x2258(0x0150)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_DD3889E342A5D03C640528A97E4D3B28;// 0x23A8(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F61E0BCF4D8673209A1740867FA4D40B;// 0x2598(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_365D3ACF474FA818D36E90890C63965B;// 0x2678(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1EB7458540D92654D747C997DA40A469;// 0x26F0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E1E58DAE4F1D2203D1A1D7B177435752;// 0x2790(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A94E46C45C84CA15BA2C8BD7FCAE960;// 0x2830(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7CAEAE0642DF539AF64C3C9FACC64414;// 0x28A8(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_D89B8A0E4A46D15874503A9A6BD524AE;// 0x28D8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B751018F4A6AA5651DF05BA3833AD291;// 0x2920(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_833B34C9414AC1C7BCEEA48B1C7196A5;// 0x2968(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA60E27C4777CE00360312BB196C5F23;// 0x2A08(0x0030)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_D851DFDC483F78D4EAA22B93237B96A2;// 0x2A38(0x01F0)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_7A7AB61949D5571EC30570B52C4D42BF;// 0x2C28(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2C181114494B887D79B62E9850F50428;// 0x2E18(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8CA57E6942F03BD9E43D31B818C4FCD8;// 0x2EF8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_853E42D84AFC62678C3DDC898DF2A596;// 0x2F98(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE78DF504D091D4DAB8F838F1F4D58F3;// 0x3078(0x0030)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_0684144848DB8FFA7B87E5B0A2D84DA8;// 0x30A8(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_60C6B1D642BC4F2AAD7C86BD2A53CC2C;// 0x31F8(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_0C8CE0334F43DA1D8342108AD2492311;// 0x3348(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_3AA8307F4B31335DEDC27A91EEB6E35C;// 0x3498(0x0150)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_41A40DD044D9659BD6A16D80547254CF;// 0x35E8(0x01F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ECF30A674BB4A82A70B05D9AA651E87B;// 0x37D8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B7BA48B454F182F02CF6C83EC4F57BC;// 0x3850(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A3142344D9F8147A7982FBD9C16D17F;// 0x38C8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B99A6784B707571C1DA128478E4B5E2;// 0x3940(0x0078)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_609A6014467C39F4F1F58AB8F9462B08;// 0x39B8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83A52B104D9B553A70390E84D8C10ED7;// 0x3A68(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C4FB8F814F606919DFCCC893012E97E5;// 0x3B08(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66F899354B6B017FFA04D68F675932AD;// 0x3BE8(0x0030)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_9C812856429CF134546C758E9A2108C9;// 0x3C18(0x01F0)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_537CC6E6405BF92EC003A981790D1EC8;// 0x3E08(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_181D9160453C281D639385A31321A55F;// 0x3FF8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5DF661A46F3A0BCF91CE5BD153494FC;// 0x40D8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D5E4CA2F4C6216821470CB82A0F9AEBF;// 0x4178(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F39FEE6D40EF470112F6C5BFDEB3FEB0;// 0x4258(0x0030)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_56385CBF4EA306F036C001AD7FE02EA4;// 0x4288(0x0150)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_374303D748F8EFA47BA0358D6E43F0B0;// 0x43D8(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_195B649E445A9AE2663FD8A841BD5C77;// 0x4528(0x0078)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_378515F44DFC53AEA8175CB9128D6DB9;// 0x45A0(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FA7A1DDD4EEB856C24ACB59AF3B3C237;// 0x4608(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7832D7494D9F782A930EC2A3C01F1126;// 0x46A8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F62C1F0B4DACD58D5D1773925A2A906A;// 0x46D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A2D4E9142B1C22C42EB0A924653462E;// 0x4788(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE6FC1C847C663B969EA9D8320A6A232;// 0x4800(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C7690FD24961DD879C366CB7DCC319D7;// 0x4830(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F224A2D04DF847B204CAC5860BA21674;// 0x48E0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0763AB0143D1384B6A0FE38FBA876A42;// 0x4980(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_71F5166D4C72FFF0F3B0B6BF3892C398;// 0x4A20(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0DEF390047AF266A3ECB22A318A31659;// 0x4A40(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1F718FD34D9288412E5611ADB640C271;// 0x4A60(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A84B1C324736BE5F3C0A6389DA47F1DF;// 0x4B68(0x00A0)
	struct FAnimNode_AimOffsetSkinned                  AnimGraphNode_AimOffsetSkinned_64B7FD9C4BB165FCDADA549F3ECE1680;// 0x4C08(0x01B0)
	float                                              MaxMantleHt;                                              // 0x4DB8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Max2StoryMantleHt;                                        // 0x4DBC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      StringMantlesTogether;                                    // 0x4DC0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Start_Swim_Moving;                                        // 0x4DC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Start_Swim_Moving_B;                                      // 0x4DD0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Start_Swim_Moving_A;                                      // 0x4DD8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Cached_Angle;                                             // 0x4DE0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Stop_Swim_Moving_A;                                       // 0x4DE8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Stop_Swim_Moving_B;                                       // 0x4DF0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Stop_Swim_Moving;                                         // 0x4DF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Cached_Stop_Angle;                                        // 0x4E00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EKSMovementDirection                               locoStartDir;                                             // 0x4E04(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EKSMovementDirection                               locoStopDir;                                              // 0x4E05(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                TurnVal;                                                  // 0x4E08(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      Transition_Downed;                                        // 0x4E0C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      Transition_Pivot;                                         // 0x4E0D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      IsFallingToWater;                                         // 0x4E0E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Replace_with_code;                                        // 0x4E10(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AKSCharacter*                                Character;                                                // 0x4E20(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      Transition_State_Lock;                                    // 0x4E28(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      Temp_bool_Variable;                                       // 0x4E29(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      Temp_bool_Variable_2;                                     // 0x4E2A(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll;                               // 0x4E2C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch;                              // 0x4E30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw;                                // 0x4E34(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll_2;                             // 0x4E38(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch_2;                            // 0x4E3C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw_2;                              // 0x4E40(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll_3;                             // 0x4E44(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch_3;                            // 0x4E48(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw_3;                              // 0x4E4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      Temp_bool_Variable_3;                                     // 0x4E50(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll_4;                             // 0x4E54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch_4;                            // 0x4E58(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw_4;                              // 0x4E5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select_Default;                                    // 0x4E60(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x4E6C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x4E70(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x4E74(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select_Default_2;                                  // 0x4E78(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll_5;                             // 0x4E84(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch_5;                            // 0x4E88(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw_5;                              // 0x4E8C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X_2;                                 // 0x4E90(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y_2;                                 // 0x4E94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z_2;                                 // 0x4E98(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll_6;                             // 0x4E9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch_6;                            // 0x4EA0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw_6;                              // 0x4EA4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      Temp_bool_Variable_4;                                     // 0x4EA8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select_Default_3;                                  // 0x4EAC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select_Default_4;                                  // 0x4EB8(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X_3;                                 // 0x4EC4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y_3;                                 // 0x4EC8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z_3;                                 // 0x4ECC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x4ED0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Event_StartLocation;                               // 0x4ED4(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Event_StopLocation;                                // 0x4EE0(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	EKSTurnInPlaceAnimationVariant                     K2Node_Event_AnimationVariant;                            // 0x4EEC(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DelayTime;                                   // 0x4EF0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      K2Node_SwitchEnum_CmpSuccess;                             // 0x4EF4(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AKSCharacter*                                K2Node_DynamicCast_AsKSCharacter;                         // 0x4EF8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      K2Node_DynamicCast_bSuccess;                              // 0x4F00(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Event_PivotLocation;                               // 0x4F04(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      K2Node_Event_bShouldLock;                                 // 0x4F10(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x4F11(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("DynamicClass Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C");
		return ptr;
	}


	void SwimNotifyTransitionStateLock(bool* bpp__bShouldLock__pf);
	void SwimNotifyTransitionEnd();
	void LocomotionStop(struct FVector* bpp__StopLocation__pf);
	void LocomotionStart(struct FVector* bpp__StartLocation__pf);
	void LocomotionPivot(struct FVector* bpp__PivotLocation__pf);
	void EventStopSwimming();
	void EventStartSwimming();
	void EventDoGoDown();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Swimming_AnimGraphNode_TransitionResult_EDD270D34439CCC54F7076BF79F86501();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Swimming_AnimGraphNode_TransitionResult_E3E49F7F454B47E501D44EA073EE26EF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Swimming_AnimGraphNode_TransitionResult_CE2D32B1481E672703161D88E16C4293();
