#pragma once

// RogueCompany (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct UIColorPalette_v2.UIColorPalette_v2
// 0x0130
struct FUIColorPalette_v2
{
	struct FLinearColor                                Silver_27_913E6B5F4BDCB81BD42D07B27206F261;               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Vulcan_28_8A2E98974234C6FBEA6AB2A063B59778;               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Ruby_29_0ED9A2CA4F47AB6D89244F8C0618F009;                 // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DarkVulcan_30_A3C4365940E8C28F156BCA90D52342C2;           // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Steel_31_3CB56E054B7D17D8AEED82968E47AE65;                // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Black_17_EC0FC2FC4B94E66BA1021FA092407FA7;                // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Traffic_32_C3A2BF9F48894B46D4E45B8E9BDA3700;              // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RadarBlue_33_C3777EA94DE3C020C81F759F8200CE1E;            // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                White_34_07F976774AC9884BE5DCBCB86A62D5E3;                // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityCommon_37_16227CF04FAA783361F20CB2A9E5B695;         // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityUncommon_42_9CB2131443E1EECE8F910CAD6BDDFE00;       // 0x00A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityRare_45_C37DBECF41D3727FF70DD3AB784AD115;           // 0x00B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityEpic_46_57EC98534F2CF5FCC6BECB8F0E4ED791;           // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityLegendary_47_1AA9CB46443145EAD6F2E3804560E11E;      // 0x00D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityCommonHighlight_54_16C5475149D2E8EEEE7DA496498579E6;// 0x00E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityUncommonHighlight_55_A645E3564897359B1FB2CAB9DB71ECC5;// 0x00F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityRareHighlight_56_4646CB224527578B550D96BB6CD22B32;  // 0x0100(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityEpicHighlight_57_4F07DEE6402DE90C1FAFA59D64F0EDC4;  // 0x0110(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                RarityLegendaryHighlight_58_B0B56A814F878A0B4E357E82FCC4DDD3;// 0x0120(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
